In [1]:
#extraction and cleaning operation perform in pandas 
'''it help to extract data and modify so that we can use it accordingly '''

'it help to extract data and modify so that we can use it accordingly '

In [2]:
import pandas as pd 
import numpy as np

In [6]:
pd.Series([1,2,3,4])# s is capital

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
pd.Series([1,2,3,4],index=['A','b','c','d'],dtype='float',name='mark')

A    1.0
b    2.0
c    3.0
d    4.0
Name: mark, dtype: float64

# DataFrame

In [8]:
pd.DataFrame([[1,2,3],[4,5,6]],index=['A','B'],columns=['Maths','Science','History'])

   Maths  Science  History
A      1        2        3
B      4        5        6

In [9]:
pd.DataFrame([[60,50,55],[45,56,75],[85,95,82]],index=['I','II','III'],columns=['runs','wicket','over'])

     runs  wicket  over
I      60      50    55
II     45      56    75
III    85      95    82

In [10]:
df=pd.DataFrame(np.arange(10,20).reshape(5,2),columns=['A','B'])

In [11]:
df

    A   B
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [20]:
df=pd.DataFrame(np.arange(10,20).reshape(5,2),columns=['a','b'])

In [18]:
df

    a   b
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [22]:
heroes=[('batsman',50),('superman',680),('ironman',100)]
df=pd.DataFrame(heroes,columns=['name','power'])

In [23]:
df

       name  power
0   batsman     50
1  superman    680
2   ironman    100

In [24]:
dic={'name':['Santosh','Rajesh','Ramesh','Rahul'],'math':[85,56,65,72],'Science':[58,65,82,90]}

In [25]:
df=pd.DataFrame(dic)

In [26]:
df

      name  math  Science
0  Santosh    85       58
1   Rajesh    56       65
2   Ramesh    65       82
3    Rahul    72       90

# indexing and slicing

In [27]:
df['name']

0    Santosh
1     Rajesh
2     Ramesh
3      Rahul
Name: name, dtype: object

In [29]:
df[['name','Science']]

      name  Science
0  Santosh       58
1   Rajesh       65
2   Ramesh       82
3    Rahul       90

In [31]:
df[['name','Science','math']]

      name  Science  math
0  Santosh       58    85
1   Rajesh       65    56
2   Ramesh       82    65
3    Rahul       90    72

In [33]:
# for row selection 
df.iloc[2,2]

82

In [34]:
df.iloc[2,1]

65

In [35]:
df.iloc[1,2]

65